title: Execution Policy Bypass with Download Cradle
id: 6f7g8h9i-6789-0123-45gh-ijkl67890123
status: experimental
description: Detects PowerShell execution policy bypass combined with download cradle
references:
    - https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
author: J3rrryR195
date: 2024-09-27
tags:
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\\powershell.exe'
        CommandLine:
            - '-ExecutionPolicy Bypass'
            - 'DownloadString'
            - 'iwr'
    condition: selection
falsepositives:
    - Legitimate use of bypasses for specific tasks
level: critical
